ninety_nine_cats/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("color", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["color", "Black"], ["name", "kitty"], ["created_at", "2021-05-27 21:30:34.370062"], ["updated_at", "2021-05-27 21:30:34.370062"]]